#coding:utf-8


# 考虑到TDID是由 0~9 a~z 一共只有这36个字符组成的
# 所以只要建立36个文件夹就能涵盖到所有的开头字符

# 如果对于记录无法预测组成元素(基础字符)
# 则需要实现循环读取一遍首字母用于构建下面这个首字母列表

# list_name_with_first_word = ['0', '1', ..., '9', 'a', 'b', ..., 'z',]
list_name_with_first_word = [str(i) for i in range(10)] + [chr(s) for s in range(97, 123)]


trans_month = {'Jan16': '201601', 'Feb16': '201602', 'Mar16': '201603', 'Apr16': '201604', 'May16': '201605', 'Jun16': '201606', 
		'Jul16': '201607', 'Aug16': '201608', 'Sep16': '201609', 'Oct16': '201610', 'Nov16': '201611', 'Dec16': '201612',}
list_app_name = ['微信', 'QQ', '微博', '支付宝钱包', '京东', '手机淘宝', '天猫',
		'豌豆荚', '360手机助手', '应用宝', '百度手机助手', '小米应用商店', 
			'安卓市场', 'PP助手', '91助手', 'MM商场', '淘宝手机助手',
		'唯品会', '赶集生活', '58同城', '聚美优品', '国美在线', '苏宁易购', 
			'当当网', '蘑菇街', '1号店', '美丽说', '楚楚街9块9包邮购', '微店', '微店-买家版',
			'聚划算', '口袋购物', '亚马逊购物', '乐蜂网', '易迅网', '有赞微小店', 'V店', '转转', '闲鱼',
			'美团团购', '大众点评', '百度糯米-美食、电影、KTV、旅游酒店', '拉手团购',
		'小红书海外购物神器', '洋码头海外扫货神器', '考拉海购',
		'QQ音乐', 'QQ空间', '米聊（视频聊天交友）', '陌陌', '百度贴吧', 'YY', '虎牙直播', '唱吧', 'Facebook',
			'糗事百科', '豆瓣', '天涯社区', '世纪佳缘', '百合婚恋', '来往', 
		'去哪儿旅行-酒店.火车', '携程旅行', '艺龙旅行', '同程旅游', '途牛旅游', '铁路12306', '蚂蜂窝自由行', 
			'TripAdvisor(猫途鹰)', '铂涛旅行', '铁友火车票', '穷游', '驴妈妈旅游', 'Airbnb',
		]





